app/controllers/api/v1/drugs_controller.rb

SELECT "drugs".* FROM "drugs"
---
  def index
    @drugs = Drug.all

SELECT  "drugs".* FROM "drugs" WHERE "drugs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @drug = Drug.find(params[:id])